"""
SWEA 25948  빙하의 이동
https://swexpertacademy.com/main/talk/solvingClub/problemView.do?solveclubId=AZt8IiBqxEDHBIN6&contestProbId=AZve05OqCl3HBIN6&probBoxId=AZt8IiBqxEHHBIN6&type=PROBLEM

풀이일 : 2026-09-16   결과: 틀림
한도   : time 25개 테스트케이스를 합쳐서 C++의 경우 2초 / Java의 경우 3초 / Python의 경우 10초 / memory 힙, 정적 메모리 합쳐서 262144 kbytes 이내, 스택 메모리 1024 kbytes 이내 / time_sec 10
난이도 : D5  |  정답률 80.43%
제약   : 1. 바다의 크기 N x N ( 5 ≤ N ≤ 100)
제약   : 2. 각 테스트케이스별로 oneYearLater() 호출 횟수는 최대 100 회이다.

[채점] accepted  1/1  (7.099s)

[문제]
N x N 크기의 바다가 있다.

바다의 각 좌표에는 최대 1 개의 얼음덩어리가 존재한다.

얼음덩어리들은 상하좌우로 다른 얼음덩어리들과 인접할 수 있는데, 이렇게 인접하여 연결되어 있는 얼음덩어리들을 “빙하” 라고 한다.

하나의 빙하를 이루는 얼음덩어리의 개수를 그 빙하의 “면적” 이라 한다.

얼음덩어리들은 각각 높이 ( 1 ≤ 높이 ≤ 1,000 ) 가 있는데, 하나의 빙하를 이루는 모든 얼음덩어리들의 높이의 합을, 그 빙하의 “부피” 라 한다.

또한 그 빙하의 최 상단 행의 좌측 열에 위치한 얼음덩어리의 좌표를 그 빙하의 “위치” 라 한다.

이 문제에서의 좌표는 좌측 상단을 ( 0 , 0 ) 으로 표기하며, ( Y 축 , X 축 ) 의 순서로 표기한다.

바다의 왼쪽 끝과 오른쪽 끝은 서로 인접해 있으며, 위쪽 끝과 아래쪽 끝도 서로 인접해 있다.

즉, ( 0, 0 ) 의 왼쪽에는 ( 0 , N-1 ) 이 존재하고, ( 0, 0 ) 의 위쪽에는 ( N-1, 0 ) 가 존재한다.

[Fig. 1-1] 에는 N 이 5 인 바다에 1 개의 빙하가 존재 하며, 이 빙하의 면적은 15, 부피는 60 이다.

이 빙하의 위치는 (0, 3) 이다.

[Fig. 1-2] 에는 N 이 이 6 인 바다에 1 개의 빙하가 존재하며, 이 빙하의 면적은 10, 부피는 35이다.

이 빙하의 위치는 (0, 1) 이다.

[[IMG:1]]

빙하는 매년 3 가지 과정을 순서대로 거치며 크기와 위치가 변한다.

a. 융해 : 상하좌우 바다에 인접한 얼음덩어리의 높이가 1 씩 줄어든다.

b. 이동 : 빙하가 상하좌우 중 한 방향으로 1 칸씩 이동한다.

c. 병합 : 다른 빙하가 서로 충돌하거나, 상하좌우로 인접할 경우 하나의 빙하가 된다.

a. 융해

빙하를 구성하고 있는 얼음덩어리 중 바다와 인접한 얼음덩어리들의 높이가 1 씩 줄어든다.

높이가 0 이 될 경우 그 얼음덩어리는 사라진다.

융해에 의해 빙하는 2 개 이상의 빙하로 나누어 질 수 있다.

빙하가 나누어지더라도 각 빙하의 이동 방향은 변하지 않는다.

b. 이동

빙하는 매년 1 칸씩 인접 좌표로 이동한다.

모든 빙하는 동시에 이동을 한다.

초기에 이동하는 방향은 입력으로 주어진다.

c. 병합

이동 후 서로 다른 빙하를 구성하고 있는 얼음덩어리가 같은 좌표에 겹치거나 상하좌우로 인접할 수 있다.

겹칠 경우 두 얼음덩어리 중 높이가 높은 얼음덩어리만 그 좌표에 남는다.

병합 된 빙하는 이동 방향이 바뀌며, 다음과 같이 각 빙하가 이동하기 전의 상태를 비교하여 병합 후의 이동방향을 결정한다.

1. 부피가 큰 빙하의 이동방향을 따른다.

2. 부피가 같을 경우 면적이 작은 빙하의 이동방향을 따른다.

3. 면적이 같을 경우, 두 빙하의 위치 중 Y 좌표가 작은 위치에 있는 빙하의 이동방향을 따른다.

4. Y 좌표가 같을 경우, 두 빙하의 위치 중 X 좌표가 작은 위치에 있는 빙하의 이동방향을 따른다.

[Fig. 2] 에서는 3 개의 빙하가 병합되는 과정을 보여준다.

3개 빙하는 부피와 면적이 같다.

따라서 병합 후 이동방향을 결정하는 조건 3, 4에 따라, 빙하 위치(2, 1) 에 있는 빨간 테두리로 둘러 쌓인 빙하의 이동방향을 따른다

노란색 셀은 겹쳐진 얼음덩어리 중 높이가 높은 얼음덩어리만 그 좌표에 남은 것을 표시한다.

빙하가 병합되는 과정에서 일부 얼음덩어리가 사라지더라도, 이동방향을 정할 때는 이동하기 전의 상태를 비교함에 유의하라.

[[IMG:2]]

당신은 N x N 크기의 바다에서 얼음덩어리들의 높이와 M 개 빙하의 이동 방향이 주어졌을 때,

빙하의 변화를 시뮬레이션 하여 해당 년도의 빙하의 상태를 구해야 한다.

다음은 구현해야 할 API이다.

※ 아래 함수 signature는 C/C++에 대한 것으로 다른 언어에 대해서는 제공되는 Main과 User Code를 참고하라.

void init(int N, int M, int mIceBlock[][], int mIceGroup[][])

각 testcase 시작 시 1번 호출된다.

N 은 전체 바다의 가로 및 세로 길이를 의미한다.

M 은 초기 상태 때, 빙하의 개수를 의미 한다.

mIceBlock[][] 에는 N x N 개의 숫자가 전달되며 각 좌표의 얼음덩어리 “높이” 에 대한 정보를 담고 있다.

각 얼음덩어리의 높이는 최대 1,000 이다.

숫자 0 은 그 좌표에 빙하가 존재하지 않음을 의미한다.

mIceGroup[][] 에는 M * 3 개의 숫자가 전달되며 각 3 개의 숫자는,

각각 빙하를 구성하고 있는 얼음덩어리 중 1 개에 대한 X, Y 축 좌표와,

그 빙하가 움직이는 방향 ( 0 : ↑, 1 : →, 2 : ↓, 3 : ←) 을 의미한다.

Parameters

N : 전체 바다의 가로, 세로 길이 (5 ≤ N ≤ 100)

M : 빙하의 개수 (1 ≤ M ≤ 5,000)

mIceBlock[][] : 각 좌표에 존재하는 얼음덩어리 “높이”

mIceGroup[][] : 각 빙하를 구성하고 있는 얼음덩어리 1 개 에 대한 X, Y 좌표 및 빙하의 이동 방향

RESULT oneYearLater(void)

마지막 빙하의 상태를 기준으로 1년이 지난 후 빙하의 상태를 반환한다.

반환은 RESULT 구조체의 mheights 배열에 각 좌표의 얼음덩어리 “높이” 값을 저장한다.

[[IMG:3]]

예를 들어, 얼음덩어리의 상태가 위와 같다면 mheights[0][0] = 1, [0][1] = 2, [1][0] = 3, [1][1] = 4 를 저장한다.

Return

각 좌표의 얼음덩어리 “높이” 값

[예시]

첫번째 테스트케이스가 어떻게 진행되는지 살펴보도록 하겠다.

첫번째 테스트케이스의 시작 시점에서의 상태는 [Fig. 3] 와 같다.

빨간색으로 테두리 친 영역 안의 빙하(이하 빨간색 빙하) 는 면적 9, 부피 54, 위치 ( 0 , 2 ) 이고 아래쪽 방향으로 움직이고 있다.

( 9 , 4 ) 위치의 얼음덩어리도 빨간색 영역의 빙하에 포함되는 것에 유의하자.

파란색으로 테두리 친 영역 안의 빙하(이하 파란색 빙하)는 면적 2, 부피 16, 위치 ( 2 , 0 ) 이고 오른쪽 방향으로 움직이고 있다.

녹색으로 테두리 친 영역 안의 빙하(이하 녹색 빙하)는 면적 23, 부피 130, 위치 ( 3 , 8 ) 이고, 위쪽 방향으로 움직이고 있다.

[[IMG:4]]

1 년 후의 상태는 [Fig. 4] 와 같다

빨간색 빙하와 파란색 빙하가 병합되었고, 녹색 빙하는 녹색과 노란색 2 개의 빙하로 나뉘어 졌다.

빙하가 나뉘어 지더라도 이동 방향은 변하지 않는다.

[[IMG:5]]

2 년 후 상태는 [Fig. 5] 와 같다.

빨간색 빙하와 초록색 빙하가 병합되었으며, 빨간색 빙하의 부피가 더 크므로, 빨간색 빙하의 이동방향으로 정해졌다.

[[IMG:6]]

3 년 뒤 상태는 [Fig. 6] 과 같다.

빨간색 빙하와 노란색 빙하가 병합되어 하나의 빙하가 되었으며, 이동 방향은 빨간색 빙하의 이동방향을 따른다.

[[IMG:7]]

4 년 뒤 상태는 [Fig. 7] 과 같다.

[[IMG:8]]

5 년 뒤 상태는 [Fig. 8] 과 같다.

[[IMG:9]]

[예제 1]
입력:
25 100
10 3 5
0 0 7 9 5 5 6 0 0 0
0 0 0 0 6 0 0 0 0 0
8 8 0 0 6 0 0 0 0 0
0 0 0 0 5 0 0 0 7 8
0 0 0 0 0 0 0 0 6 4
4 0 0 0 0 0 0 7 8 0
8 0 0 0 0 0 0 8 6 0
9 7 4 2 1 2 5 9 5 0
2 5 6 7 0 0 0 0 0 0
0 0 0 0 5 0 0 0 0 0
2 0 2
0 2 1
8 3 0
0 0 0 0 4 0 0 0 0 0 0 0 6 8 5 4 5 0 0 0 0 7 7 0 5 0 0 0 6 7 0 0 0 0 5 0 0 0 5 3 3 0 0 0 4 0 0 6 7 0 7 0 0 0 0 0 0 7 5 0 8 6 3 1 0 1 4 8 4 0 1 4 5 6 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 3 0 0 0 5 6 0 0 5 7 5 3 4 0 4 2 2 6 6 0 4 0 0 5 6 0 6 0 0 0 4 0 0 6 4 0 7 5 2 0 3 0 3 7 3 0 0 3 4 5 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 4 5 0 0 0 0 0 0 0 0 3 1 0 0 0 0 2 0 0 4 5 0 0 0 4 6 5 2 3 5 3 0 1 5 5 0 3 0 2 6 2 0 5 0 0 0 3 0 0 0 0 0 6 4 1 0 2 0 0 0 0 0 0 2 3 4 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 3 4 0 0 0 0 0 0 0 0 2 0 0 0 0 0 1 0 0 3 4 0 0 0 3 5 5 1 2 5 2 0 0 4 4 0 2 0 1 5 1 0 4 0 0 0 2 0 0 0 0 0 5 3 0 0 1 0 0 0 0 0 0 1 2 3 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 2 3 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 2 3 0 0 0 2 4 5 0 1 5 1 0 0 3 3 0 1 0 0 4 0 0 3 0 0 0 1 0 0 0 0 0 4 2 0 0 0 0 0 0 0 0 0 0 1 2 0 0 0 0 0 0
15 29 10
0 0 16 0 0 20 37 0 0 11 0 0 34 17 0
0 0 18 32 0 0 0 0 0 0 0 0 0 0 0
47 0 0 44 0 0 4 0 4 0 0 0 19 28 0
0 0 0 0 21 49 0 0 0 0 0 0 15 17 0
0 44 34 11 0 0 0 12 0 0 45 0 0 0 39
0 22 18 16 0 0 0 0 0 24 0 11 0 0 0
7 0 0 44 42 0 6 0 0 0 0 16 0 0 5
0 0 0 15 0 48 0 0 38 50 0 0 0 14 0
0 14 0 0 0 0 0 0 0 27 0 0 0 0 0
0 0 0 0 0 36 0 0 0 0 0 14 0 0 0
0 12 46 0 21 0 50 8 26 0 25 0 0 0 0
0 48 0 0 47 0 0 39 32 0 0 0 0 0 45
0 42 46 0 41 36 43 0 46 0 0 0 0 0 0
0 0 0 0 30 0 0 0 0 0 2 37 30 0 0
0 0 0 0 0 30 0 0 34 0 43 0 10 0 0
2 0 2
5 0 3
9 0 3
12 0 2
0 2 1
6 2 2
8 2 3
12 2 1
4 3 2
1 4 0
7 4 0
10 4 0
14 4 1
9 5 3
11 5 0
0 6 1
6 6 0
5 7 3
8 7 3
13 7 0
1 8 3
5 9 3
11 9 1
1 10 2
4 10 3
6 10 0
10 10 2
14 11 1
8 14 1
0 0 0 0 19 36 0 0 10 0 42 0 9 0 0 0 0 15 0 0 0 0 0 0 0 0 0 33 16 0 0 46 17 31 0 0 0 3 0 0 0 0 0 18 27 0 43 33 43 0 0 3 11 0 0 44 0 0 14 16 38 21 17 15 20 48 0 0 0 0 0 10 0 0 0 0 0 0 43 41 0 5 0 23 0 0 15 0 0 0 4 6 0 14 0 0 0 0 0 0 0 0 0 13 0 0 0 0 0 47 0 0 37 49 0 0 0 0 0 0 13 0 0 0 0 0 0 0 26 0 0 0 0 0 0 0 0 0 0 35 0 49 7 25 0 0 0 13 0 0 0 0 0 20 0 0 0 38 31 0 0 0 0 0 0 44 11 45 46 0 0 0 0 45 0 24 0 0 0 0 0 47 0 40 35 42 0 0 0 0 0 0 0 0 0 0 41 45 29 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 29 0 0 0 0 33 1 36 29 0 0
0 0 14 18 35 0 0 9 0 32 0 35 28 0 0 0 45 17 30 0 0 0 2 0 0 41 0 8 0 0 0 42 33 42 0 0 2 10 0 0 43 0 32 15 0 37 20 16 15 19 47 0 0 0 0 0 9 0 17 26 0 0 0 42 40 0 4 0 0 0 0 14 0 13 15 0 0 0 13 0 0 0 22 0 0 0 0 0 12 0 0 3 5 0 0 0 0 36 48 0 0 0 0 0 0 0 0 0 46 0 0 0 0 25 0 0 0 0 0 0 0 0 0 0 0 0 48 6 24 0 0 0 0 0 12 0 0 0 34 0 0 0 37 30 0 0 0 0 12 0 0 0 19 0 0 0 0 0 44 0 0 0 0 0 0 10 44 45 0 0 0 0 0 0 0 0 0 0 0 43 46 0 39 34 41 0 0 0 0 0 23 0 0 0 0 40 44 28 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 28 0 0 0 0 0 0 0 0 0 0 0
0 44 17 29 0 0 0 1 0 0 40 0 7 0 0 0 41 33 41 0 0 1 9 0 31 42 0 31 14 0 36 19 15 15 18 46 0 0 0 0 0 8 0 16 25 0 0 0 41 39 0 3 0 0 0 0 13 0 12 14 0 0 0 12 0 0 0 21 0 0 0 0 0 11 0 0 0 0 0 0 0 0 35 47 0 0 0 0 0 0 0 0 2 4 0 0 0 0 24 0 0 0 0 0 0 0 0 45 0 0 0 47 5 23 0 0 0 0 0 0 0 0 0 0 0 0 0 36 29 0 0 0 0 11 0 0 0 33 0 0 0 0 0 43 0 0 0 0 0 11 0 18 0 0 0 0 0 0 0 0 0 0 0 0 0 43 44 0 0 0 0 0 0 0 0 0 0 0 42 9 0 38 33 40 0 0 0 0 0 0 0 0 0 0 45 43 27 0 27 0 0 0 0 0 0 22 0 0 0 39 0 0 13 18 34 0 0 8 0 0 0 34 27 0 0
0 40 33 40 0 0 0 8 0 30 41 0 30 13 0 35 18 14 15 17 45 0 0 0 0 0 7 0 15 24 0 0 0 40 38 0 2 0 0 0 0 12 0 11 13 0 0 0 11 0 0 0 20 0 0 0 0 0 10 0 0 0 0 0 0 0 0 34 46 0 0 0 0 0 0 0 0 0 0 0 0 0 0 23 0 0 0 0 0 0 0 1 3 0 0 0 46 4 22 0 0 0 0 0 0 0 44 0 0 0 0 0 35 28 0 0 0 0 0 0 0 0 0 0 0 0 0 0 42 0 0 0 10 0 0 10 32 0 0 0 0 0 0 0 0 0 0 0 0 0 42 43 0 0 0 0 0 0 0 0 0 0 0 41 8 0 37 32 39 0 0 0 0 0 0 0 0 0 0 44 42 26 0 26 0 0 0 0 0 0 0 0 0 0 38 0 0 12 18 33 0 0 7 0 0 0 33 26 0 0 0 43 17 28 0 0 0 0 0 0 39 0 6 0 0
34 17 13 15 16 44 0 0 0 0 0 6 0 14 23 0 0 0 39 37 0 1 0 0 0 0 11 0 10 12 0 0 0 10 0 0 0 19 0 0 0 0 0 9 0 0 0 0 0 0 0 0 33 45 0 0 0 0 0 0 0 0 0 0 0 0 0 0 22 0 0 0 0 0 0 0 0 0 0 0 0 45 3 21 0 0 0 0 0 0 0 2 0 0 0 0 0 34 27 0 0 0 0 0 0 43 0 0 0 0 0 0 0 41 0 0 0 0 0 0 9 31 0 0 0 0 0 0 0 0 0 9 0 0 0 41 42 0 0 0 0 0 0 0 0 0 0 0 40 7 0 36 31 38 0 0 0 0 0 0 0 0 0 0 43 41 25 0 25 0 0 0 0 0 0 0 0 0 0 37 0 0 11 18 32 0 0 6 0 0 0 32 25 0 0 0 42 17 27 0 0 0 0 0 0 38 0 5 0 0 0 39 33 39 0 0 0 7 0 29 40 0 29 12 0
0 0 0 38 36 0 0 0 0 0 0 10 0 9 11 0 0 0 9 0 0 0 18 0 0 0 0 0 8 0 0 0 0 0 0 0 0 32 44 0 0 0 0 0 0 0 0 0 0 0 0 0 0 21 0 0 0 0 0 0 0 0 0 0 0 0 44 2 20 0 0 0 0 0 0 0 0 0 0 0 0 0 33 26 0 0 0 0 0 0 42 0 0 0 0 0 0 0 40 0 0 0 0 0 0 8 30 0 0 0 0 0 0 0 0 0 0 0 0 0 40 41 0 0 0 0 0 0 0 0 8 0 0 39 6 0 35 30 37 0 0 0 0 0 0 0 0 0 0 42 40 24 0 24 0 0 0 0 0 0 0 0 0 0 36 0 0 10 18 31 0 0 5 0 0 0 31 24 0 0 0 41 17 26 0 0 0 0 0 0 37 0 4 0 0 0 38 33 38 0 0 0 6 0 28 39 0 28 11 0 33 16 12 15 15 43 0 0 0 0 0 5 0 13 22
0 0 0 8 0 0 0 17 0 0 0 0 0 7 0 0 0 0 0 0 0 0 31 43 0 0 0 0 0 0 0 0 0 0 0 0 0 0 20 0 0 0 0 0 0 0 0 0 0 0 0 43 1 19 0 0 0 0 0 0 0 0 0 0 0 0 0 32 25 0 0 0 0 0 0 41 0 0 0 0 0 0 0 39 0 0 0 0 0 0 7 29 0 0 0 0 0 0 0 0 0 0 0 0 0 39 40 0 0 0 0 0 0 0 0 0 0 0 38 5 0 34 29 36 0 0 0 0 0 7 0 0 0 0 41 39 23 0 23 0 0 0 0 0 0 0 0 0 0 35 0 0 9 18 30 0 0 4 0 0 0 30 23 0 0 0 40 17 25 0 0 0 0 0 0 36 0 3 0 0 0 37 33 37 0 0 0 5 0 27 38 0 27 10 0 32 15 11 15 14 42 0 0 0 0 0 4 0 12 21 0 0 0 37 35 0 0 0 0 0 0 9 0 8 10
0 0 0 0 0 0 0 30 42 0 0 0 0 0 0 0 0 0 0 0 0 0 0 19 0 0 0 0 0 0 0 0 0 0 0 0 42 0 18 0 0 0 0 0 0 0 0 0 0 0 0 0 31 24 0 0 0 0 0 0 40 0 0 0 0 0 0 0 38 0 0 0 0 0 0 6 28 0 0 0 0 0 0 0 0 0 0 0 0 0 38 39 0 0 0 0 0 0 0 0 0 0 0 37 4 0 33 28 35 0 0 0 0 0 0 0 0 0 0 40 38 22 0 22 0 0 0 0 6 0 0 0 0 0 34 0 0 8 18 29 0 0 3 0 0 0 29 22 0 0 0 39 17 24 0 0 0 0 0 0 35 0 2 0 0 0 36 33 36 0 0 0 4 0 26 37 0 26 9 0 31 14 10 15 13 41 0 0 0 0 0 3 0 11 20 0 0 0 36 34 0 0 0 0 0 0 8 0 7 9 0 0 0 7 0 0 0 16 0 0 0 0 0 6 0
0 0 0 0 0 0 0 0 18 0 0 0 0 0 0 0 0 0 0 0 0 41 0 17 0 0 0 0 0 0 0 0 0 0 0 0 0 30 23 0 0 0 0 0 0 39 0 0 0 0 0 0 0 37 0 0 0 0 0 0 5 27 0 0 0 0 0 0 0 0 0 0 0 0 0 37 38 0 0 0 0 0 0 0 0 0 0 0 36 3 0 32 27 34 0 0 0 0 0 0 0 0 0 0 39 37 21 0 21 0 0 0 0 0 0 0 0 0 0 33 0 0 7 18 28 0 0 5 0 0 0 28 21 0 0 0 38 17 23 0 0 0 0 0 0 34 0 1 0 0 0 35 33 35 0 0 0 3 0 25 36 0 25 8 0 30 13 9 15 12 40 0 0 0 0 0 2 0 10 19 0 0 0 35 33 0 0 0 0 0 0 7 0 6 8 0 0 0 6 0 0 0 15 0 0 0 0 0 5 0 0 0 0 0 0 0 0 29 41 0 0 0 0 0 0
0 0 0 0 0 0 40 0 16 0 0 0 0 0 0 0 0 0 0 0 0 0 29 22 0 0 0 0 0 0 38 0 0 0 0 0 0 0 36 0 0 0 0 0 0 4 26 0 0 0 0 0 0 0 0 0 0 0 0 0 36 37 0 0 0 0 0 0 0 0 0 0 0 35 2 0 31 26 33 0 0 0 0 0 0 0 0 0 0 38 36 20 0 20 0 0 0 0 0 0 0 0 0 0 32 0 0 6 18 27 0 0 0 0 0 0 27 20 0 0 0 37 17 22 0 0 4 0 0 0 33 0 0 0 0 0 34 33 34 0 0 0 2 0 24 35 0 24 7 0 29 12 8 15 11 39 0 0 0 0 0 1 0 9 18 0 0 0 34 32 0 0 0 0 0 0 6 0 5 7 0 0 0 5 0 0 0 14 0 0 0 0 0 4 0 0 0 0 0 0 0 0 28 40 0 0 0 0 0 0 0 0 0 0 0 0 0 0 17 0 0 0 0 0 0
30 114 12
0 0 15 0 0 16 0 0 0 9 0 0 0 35 0 0 0 0 0 0 0 17 0 43 18 0 0 1 0 0
0 27 38 0 48 0 0 0 0 0 0 41 0 0 0 0 48 0 0 0 0 0 27 0 0 0 0 0 0 48
6 16 0 31 0 0 0 0 41 0 0 38 0 36 0 0 22 0 0 0 0 0 25 17 0 8 0 0 46 49
0 38 33 0 0 0 6 0 0 0 0 46 42 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 45 3 36 0 17 48 0 40 0 0 0 0 0 0 0 0 0 0 33 38 0 0 0 0 0 22 0
23 0 0 50 43 0 11 0 47 0 25 15 22 0 13 0 0 9 3 0 14 0 0 0 26 0 16 0 43 0
0 22 0 0 0 0 22 0 0 0 0 0 0 0 0 0 22 0 0 47 0 25 0 0 0 0 0 43 14 8
20 0 0 0 0 0 0 0 30 0 29 0 12 0 8 0 0 0 0 0 42 0 0 0 32 36 23 0 0 0
0 0 0 0 16 0 0 0 50 0 0 45 0 0 0 0 0 0 0 0 8 0 0 26 3 0 0 4 0 0
0 5 1 0 0 0 0 0 0 17 0 16 45 19 0 0 0 0 0 0 36 0 0 0 0 0 18 0 29 21
24 27 0 16 0 0 0 0 0 0 0 0 0 19 0 4 0 0 43 0 0 0 0 0 0 0 25 0 4 25
0 0 17 42 0 0 0 0 0 46 29 0 0 0 0 35 26 20 0 22 0 0 26 0 6 0 39 49 6 0
0 49 31 0 0 0 32 0 39 19 0 0 13 0 0 0 0 0 0 0 37 11 0 0 0 43 0 0 35 5
47 0 19 0 49 0 39 44 0 0 0 0 0 0 1 40 0 0 6 16 0 0 0 0 0 48 6 0 0 5
0 36 31 0 0 0 0 37 11 37 48 0 0 29 0 0 0 26 0 13 0 0 0 0 47 0 0 0 0 0
0 0 26 0 0 47 0 0 19 18 0 0 0 19 0 26 0 48 0 39 0 0 16 0 0 31 0 0 0 29
33 0 0 5 20 37 0 0 6 0 0 0 0 37 0 0 44 0 0 0 0 0 28 0 0 0 27 18 0 0
36 26 23 0 0 19 8 0 35 0 4 0 0 0 0 0 0 0 0 0 5 0 0 25 0 0 0 0 46 0
48 0 0 34 0 41 26 0 0 0 0 0 6 26 0 0 0 0 0 36 0 0 0 0 0 0 3 17 0 34
38 0 20 2 0 39 0 19 0 0 0 0 0 0 0 8 50 0 0 0 0 0 0 2 0 0 0 29 0 0
5 22 0 37 0 44 0 6 0 0 0 0 0 0 0 0 13 0 26 0 0 26 0 28 0 15 0 33 0 0
8 0 0 24 48 0 0 0 0 0 0 0 37 0 0 41 4 0 4 0 9 0 30 0 13 2 0 0 0 29
5 3 2 0 0 45 0 0 0 0 0 30 0 0 0 42 42 0 0 0 0 5 10 0 3 14 27 20 6 30
0 0 0 0 0 24 8 0 0 0 4 44 0 0 48 0 0 46 0 0 0 0 0 2 50 0 0 0 0 0
0 38 17 0 9 0 0 0 16 42 0 0 0 0 0 0 0 25 25 0 0 0 27 0 3 0 0 0 0 10
35 0 0 0 0 0 11 0 16 0 0 0 0 0 25 0 6 8 35 0 0 21 0 11 24 0 6 15 2 0
0 47 39 0 0 0 0 0 0 0 14 0 0 0 0 22 0 0 0 32 32 0 37 0 25 0 14 0 0 0
30 0 0 0 0 0 0 0 41 46 0 16 0 0 0 22 0 0 0 0 10 0 36 0 0 0 0 45 0 0
32 0 0 0 5 0 0 0 0 0 0 0 0 0 0 31 0 0 0 15 12 33 0 0 27 0 0 49 19 0
0 39 0 0 0 16 0 0 49 0 13 2 30 0 0 0 0 13 35 9 0 37 42 0 0 0 0 0 0 48
2 0 3
5 0 1
9 0 2
13 0 3
21 0 0
23 0 3
27 0 3
4 1 3
11 1 0
16 1 3
22 1 1
3 2 3
8 2 3
13 2 2
25 2 3
6 3 0
14 3 0
3 4 2
7 4 0
10 4 3
21 4 1
28 4 2
0 5 3
6 5 3
14 5 2
17 5 1
20 5 2
24 5 2
26 5 2
1 6 0
16 6 1
19 6 3
21 6 1
0 7 2
8 7 3
10 7 2
12 7 1
14 7 2
20 7 0
24 7 2
4 8 1
11 8 2
27 8 1
1 9 3
9 9 0
3 10 3
15 10 1
18 10 0
9 11 1
19 11 0
22 11 3
24 11 3
6 12 0
12 12 2
20 12 3
25 12 3
4 13 2
14 13 2
18 13 2
13 14 2
17 14 0
24 14 1
5 15 1
15 15 2
22 15 1
25 15 0
29 15 3
0 16 1
16 16 2
26 16 2
10 17 1
20 17 0
23 17 3
28 17 2
3 18 1
12 18 1
19 18 0
26 18 2
7 19 1
15 19 0
23 19 1
18 20 1
21 20 0
12 21 3
20 21 3
22 21 1
5 22 0
11 22 1
14 23 2
17 23 3
1 24 3
4 24 3
8 24 0
22 24 1
29 24 0
0 25 2
6 25 3
14 25 2
21 25 0
26 25 0
1 26 2
10 26 0
15 26 3
22 26 1
0 27 0
8 27 3
11 27 0
27 27 0
4 28 3
24 28 1
1 29 0
8 29 1
10 29 0
29 29 1
0 14 0 0 0 0 15 0 0 0 0 40 34 0 0 0 0 0 0 0 0 0 42 17 0 0 0 0 0 0 26 37 0 47 0 0 0 0 0 8 0 37 0 0 0 47 0 0 0 0 0 0 0 26 0 0 0 0 47 0 15 0 30 0 0 0 5 40 0 0 0 45 41 0 0 21 0 0 0 0 0 0 0 24 16 0 0 45 48 5 37 32 0 0 0 0 0 16 47 0 0 0 0 35 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 46 39 0 0 0 0 0 0 0 0 0 0 0 0 32 37 0 0 0 0 0 0 0 21 0 44 2 35 0 0 0 24 14 21 0 0 0 0 0 0 8 2 0 0 0 0 0 0 0 0 21 22 0 0 0 49 42 21 0 0 0 0 0 0 0 0 12 0 0 21 46 0 41 0 24 0 25 0 15 0 42 0 0 0 0 0 0 0 0 29 0 0 0 0 0 11 0 0 0 0 0 0 7 0 0 0 0 0 0 42 13 7 19 0 0 0 0 15 0 49 0 16 28 0 0 0 7 0 0 0 0 0 35 0 0 0 31 35 22 0 3 0 4 0 0 0 0 0 0 0 0 0 0 44 0 0 0 0 0 0 42 0 0 0 0 25 2 17 0 28 20 0 26 0 15 0 0 0 0 0 0 0 0 15 44 18 0 0 3 0 0 21 0 0 0 0 0 24 0 3 24 23 0 16 41 0 0 0 31 0 0 0 45 28 0 18 0 0 34 25 19 0 0 25 0 5 0 38 48 5 0 0 48 30 0 0 0 0 38 43 0 38 18 0 0 0 0 0 0 0 0 36 10 0 0 0 42 0 0 34 4 0 0 18 0 0 0 0 0 36 10 36 47 0 12 0 0 0 0 25 0 0 0 0 0 0 47 5 0 0 4 46 35 30 0 0 48 0 0 0 18 17 0 0 0 0 0 39 0 47 5 15 0 0 0 0 0 46 0 0 0 0 0 25 0 0 0 0 46 0 5 0 0 0 0 28 0 0 0 0 0 12 0 0 0 15 0 0 0 0 28 0 0 32 0 0 4 19 36 0 34 0 0 0 0 18 0 25 0 0 0 38 4 0 0 27 0 0 0 0 0 0 0 35 25 22 0 0 18 7 0 0 0 3 0 36 0 0 43 0 0 35 0 0 24 0 0 0 26 17 0 0 33 47 0 0 33 0 40 25 0 0 0 0 0 5 25 7 49 0 0 0 0 0 0 0 0 0 0 0 45 0 0 37 0 19 1 0 38 0 18 0 0 0 0 0 0 0 12 0 0 0 0 25 0 0 1 0 2 16 0 0 0 4 21 0 36 0 43 0 5 0 0 0 0 0 0 40 3 0 0 25 0 0 0 0 27 0 14 28 0 0 28 7 0 0 23 47 0 0 0 0 0 36 0 0 0 41 41 0 0 8 0 0 0 29 0 12 1 32 0 0 29 4 2 1 0 23 7 0 0 0 0 0 29 0 0 0 0 0 0 0 0 0 4 9 0 2 13 26 19 5 0 0 0 0 0 0 0 0 15 41 0 3 43 0 0 0 45 0 0 0 0 0 0 0 1 49 0 0 0 9 37 16 0 8 0 0 0 0 15 0 0 0 0 0 47 0 24 24 0 0 0 20 0 26 0 2 5 14 1 0 0 0 0 0 0 10 0 0 0 0 13 0 0 0 0 5 7 34 0 31 31 0 0 0 10 23 13 0 0 0 34 0 0 0 0 0 0 0 0 0 0 15 0 0 24 0 0 0 0 0 9 0 0 36 0 24 0 44 0 0 31 46 38 0 0 0 0 40 45 0 0 0 0 0 21 0 0 0 0 14 11 32 0 35 0 0 0 48 18 0 0 38 0 4 0 0 0 0 0 0 12 1 29 0 30 0 0 12 34 8 0 36 41 0 0 26 0 0 0 0 47 0 0 0 0 0 15 0 0 48 0 0 0 0 0 0 0 0 0 0 0 16 0 0 0 0 0 0 0 0
13 0 0 0 0 0 0 14 0 0 0 36 0 0 0 0 0 0 0 0 0 0 0 41 16 0 0 0 0 0 36 0 46 0 0 0 4 39 0 0 0 44 40 0 46 0 0 0 0 0 0 0 0 0 25 0 0 46 0 25 0 29 0 0 0 0 0 15 46 7 0 0 0 0 20 0 0 0 0 0 0 0 0 0 23 15 44 47 4 14 31 0 0 0 0 0 0 0 45 38 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 36 0 20 0 0 0 0 0 0 0 23 13 20 0 34 0 0 0 0 0 0 0 0 0 31 36 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 7 1 0 40 0 0 0 0 0 0 20 21 0 0 0 0 43 1 34 0 0 0 0 0 0 0 0 0 0 20 45 0 0 6 0 0 23 0 0 0 41 0 0 0 0 0 48 41 20 28 0 0 0 0 0 0 0 11 0 0 0 0 0 34 0 0 0 24 0 41 13 6 0 0 0 0 0 0 0 48 0 0 0 0 43 0 0 0 0 0 0 41 0 0 0 0 30 34 21 0 2 0 18 0 0 0 0 0 0 0 0 0 15 27 14 43 17 6 0 0 0 0 20 0 0 24 1 16 0 27 19 0 3 0 0 0 14 0 0 30 0 0 0 44 27 0 17 0 0 0 2 0 0 0 0 0 0 23 0 2 23 22 25 0 0 15 40 0 0 37 42 0 37 17 0 0 0 0 0 0 33 24 18 24 0 4 0 37 47 4 0 0 0 0 47 29 0 0 0 0 35 9 36 46 0 0 0 0 0 0 24 35 9 0 0 0 41 0 0 33 3 0 0 0 0 17 0 0 0 0 0 17 16 0 0 0 0 0 0 0 46 4 14 0 0 0 46 4 0 0 3 45 0 0 34 29 0 0 0 0 0 4 0 0 0 11 27 0 0 0 0 0 11 0 0 0 0 45 0 0 0 0 0 0 0 24 0 47 0 0 45 33 0 0 0 0 17 0 38 0 0 0 37 3 0 0 0 14 0 0 27 0 0 0 0 31 0 0 3 18 35 0 0 0 0 0 35 0 0 42 0 0 34 0 0 0 0 26 0 0 0 0 0 0 0 34 24 21 0 0 17 6 0 0 0 2 4 24 24 48 0 0 0 0 23 0 0 0 0 0 0 0 0 0 32 46 0 0 32 0 39 24 0 0 0 0 0 0 0 11 0 0 0 0 24 0 0 0 0 25 16 0 0 0 0 36 0 18 0 0 37 0 17 0 0 0 0 0 39 2 0 0 0 0 0 0 0 0 0 0 1 44 0 0 0 3 20 0 35 0 42 0 4 0 0 0 0 0 40 40 0 0 0 24 0 0 0 0 26 0 13 27 0 0 27 6 0 0 22 46 0 0 0 35 0 0 0 0 0 0 0 0 0 7 0 0 0 28 0 11 1 31 0 4 28 3 1 0 0 22 6 14 40 0 0 0 28 0 0 0 0 0 0 0 0 0 3 8 0 1 12 25 18 8 0 0 0 0 0 0 0 14 0 0 0 2 42 0 44 0 0 0 0 0 19 0 0 0 0 48 0 0 0 15 0 7 0 0 0 0 0 0 0 12 0 0 0 0 23 23 0 0 30 30 0 0 0 25 0 1 4 13 36 0 0 0 0 9 0 0 0 0 0 0 14 0 0 46 6 33 0 0 0 8 0 0 0 0 9 23 43 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 23 0 0 0 0 0 13 10 31 0 0 35 0 23 47 17 0 33 0 0 0 0 0 39 44 0 0 11 0 28 20 0 0 0 11 33 7 0 35 40 0 34 0 0 0 0 0 30 45 37 0 0 0 0 0 0 0 0 0 0 29 0 0 0 0 0 0 0 15 0 0 0 0 25 0 0 0 0 46 0 0 0 0 0 14 0 0 47 39 33 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 45 0 0 0 0 3 38 0 0 0 43 39 0 0 0 0 0 0 0 0 0 40 15 0 0 0 0 0 12 0 45 0 0 0 0 0 14 45 6 0 0 0 45 0 0 0 0 0 0 0 0 0 24 0 0 45 0 24 35 28 0 0 0 0 0 0 0 44 37 0 0 0 19 0 0 0 0 0 0 0 0 0 22 14 43 46 3 13 0 0 19 0 0 0 0 0 0 0 22 12 19 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 35 30 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 39 0 0 0 30 35 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 33 0 0 6 0 0 0 5 0 0 0 0 0 19 20 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 19 44 0 0 0 33 0 0 0 22 0 40 0 0 0 0 0 0 42 0 33 0 0 0 0 0 42 0 0 0 0 0 0 40 0 0 0 0 23 0 40 13 5 0 0 0 0 0 47 40 19 27 0 0 14 26 14 42 16 10 0 0 0 0 19 0 0 29 34 20 0 1 0 17 0 0 0 0 0 0 0 47 0 0 0 43 26 0 16 0 0 0 1 0 0 0 23 0 15 0 26 18 0 2 0 0 0 0 0 13 0 36 41 0 36 16 0 0 0 0 0 0 32 23 17 23 0 0 22 0 1 22 21 24 0 0 0 0 14 39 0 0 34 8 36 45 0 0 0 0 0 0 23 35 8 0 3 0 36 46 3 0 0 0 0 0 0 46 28 0 0 0 0 16 15 0 0 0 0 0 0 0 45 3 13 0 0 40 0 0 32 2 0 0 0 0 0 0 16 0 0 0 0 3 0 0 0 10 26 0 0 0 0 0 10 0 0 45 3 0 0 2 44 0 0 0 0 33 28 0 0 0 44 32 0 0 0 0 16 0 0 0 0 0 36 2 0 0 44 0 0 0 0 0 0 0 0 0 23 0 2 17 34 0 0 0 0 0 34 0 0 41 0 0 33 0 0 0 13 0 0 26 0 0 0 0 0 0 30 46 0 0 16 5 0 0 0 1 3 23 37 47 0 0 0 0 22 0 25 0 0 0 0 0 0 0 0 0 33 23 20 0 38 23 0 0 0 0 0 0 0 10 0 0 0 0 23 0 0 0 0 0 0 0 0 0 0 31 45 0 0 31 36 0 0 0 0 0 0 0 38 1 0 0 0 0 0 0 0 0 0 0 24 15 0 0 0 0 35 0 17 0 41 0 0 16 0 0 0 0 39 39 0 0 0 0 0 0 0 0 0 0 0 0 43 0 0 0 2 19 0 34 0 0 0 3 0 0 0 0 0 0 0 0 0 0 23 0 0 0 0 25 0 12 26 0 0 26 5 0 0 21 45 0 34 0 0 0 0 0 0 0 0 0 0 0 6 0 0 0 27 0 10 1 30 17 3 27 2 0 0 0 21 5 13 39 0 0 0 27 0 0 0 0 0 0 18 0 0 2 7 0 0 11 24 0 7 0 0 0 0 0 0 0 13 11 0 0 1 43 0 0 0 0 29 29 0 0 0 0 0 0 47 0 0 35 14 0 0 0 0 0 0 0 0 0 13 0 0 22 22 0 0 0 0 7 0 0 0 0 24 0 0 3 12 0 0 0 8 0 0 0 0 0 0 0 0 0 45 5 32 0 0 0 12 9 30 0 0 0 0 8 23 42 0 0 0 0 0 0 0 0 0 0 0 10 0 22 0 0 0 0 10 32 6 0 34 39 0 0 34 0 22 46 16 0 0 0 0 0 38 43 0 0 0 0 27 19 0 0 0 0 0 0 0 0 14 0 0 0 33 0 0 0 0 32 0 0 0 0 0 0 13 0 0 46 38 32 0 0 0 0 0 0 0 0 0 0 0 0 0 0 24 0 0 29 44 36 0 0 0 0 13 0 0 0 35 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
28 43 35 0 0 0 0 13 44 5 0 0 0 0 0 0 0 0 0 0 0 39 14 0 0 0 0 0 11 0 0 44 0 0 0 0 0 0 43 36 0 0 44 0 0 0 0 0 0 0 0 0 23 0 0 44 0 23 34 0 0 44 0 0 0 0 0 0 0 21 11 18 18 0 0 0 0 0 0 0 0 0 21 13 42 45 2 12 0 27 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 38 0 0 0 0 0 0 34 29 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 29 34 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 5 0 0 0 0 32 0 0 0 0 18 19 0 0 0 0 0 0 41 0 32 0 0 0 0 0 41 0 32 18 43 0 0 39 0 0 0 0 0 0 39 0 0 0 0 0 0 0 46 39 18 26 0 0 13 25 14 41 15 9 0 0 0 0 18 0 0 22 0 39 13 4 0 0 0 0 0 0 0 0 0 46 0 0 0 42 25 0 15 0 0 0 0 0 0 0 28 34 19 0 0 0 16 0 0 0 0 0 0 0 0 35 40 0 35 15 0 0 0 0 0 0 31 22 16 22 0 14 0 25 17 0 1 0 0 0 0 0 0 0 12 0 33 7 36 44 0 0 0 0 0 0 22 35 7 0 0 21 0 0 21 20 23 0 0 0 0 0 0 13 38 0 0 15 14 0 0 0 0 0 0 0 44 2 12 2 0 35 45 2 0 0 0 0 0 0 0 0 45 27 0 0 0 2 0 0 0 9 25 0 0 0 0 0 9 0 39 0 0 31 1 0 0 0 0 0 0 0 0 15 0 0 43 31 0 0 0 0 15 0 0 0 0 0 35 1 44 2 0 0 1 43 0 0 0 0 0 0 32 27 1 16 33 0 0 0 0 0 33 0 0 40 0 0 32 0 0 43 0 0 0 0 0 0 0 0 0 0 0 22 0 0 15 4 0 0 0 0 2 22 36 46 0 0 0 0 21 12 0 0 25 0 0 0 0 0 0 0 0 29 45 0 37 22 0 0 0 0 0 0 0 9 0 0 0 0 22 24 0 0 0 0 0 0 0 0 0 0 0 32 22 30 35 0 0 0 0 0 0 0 37 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 30 44 0 0 40 0 0 0 0 0 0 0 38 38 0 0 0 0 0 0 0 0 0 0 0 23 14 42 0 0 0 34 0 16 0 0 0 0 15 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 25 0 0 0 1 18 0 33 0 0 0 2 0 0 0 0 0 0 0 0 0 0 22 0 0 0 0 24 0 11 29 0 0 25 4 0 0 20 44 0 33 0 0 0 0 0 0 0 0 0 0 0 5 0 0 0 26 0 9 1 23 16 2 26 1 0 0 0 20 4 13 38 0 26 0 0 0 0 0 28 28 0 17 0 0 1 6 0 0 10 0 0 6 0 0 0 0 0 0 0 12 12 0 42 0 0 0 0 0 0 6 0 0 0 0 0 0 0 46 0 11 34 13 0 0 0 0 0 0 0 0 0 0 21 21 0 0 0 0 11 8 29 0 0 0 0 23 0 0 2 0 0 7 0 0 0 0 0 0 0 9 0 44 4 31 0 0 9 31 5 0 33 38 0 0 0 0 7 22 41 15 0 0 0 0 0 0 0 0 0 0 26 18 0 0 0 0 0 0 0 0 13 0 0 0 0 33 0 21 45 0 0 0 0 37 42 0 12 0 0 45 38 31 0 0 0 0 0 0 0 0 0 0 0 0 0 32 0 0 0 0 0 0 0 0 0 0 12 0 0 0 34 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 23 0 31 0 0 0 0 0 2 37 0 0 0 42 38 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
30 0 0 0 0 0 0 0 42 35 0 0 43 0 0 0 0 0 0 0 38 13 0 0 0 0 0 10 0 0 27 42 34 0 0 0 0 0 0 20 10 17 17 0 0 0 0 0 0 0 0 22 0 0 43 0 22 33 0 0 0 43 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 37 20 12 41 44 1 11 0 26 0 0 43 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 3 0 0 0 0 0 33 28 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 31 0 0 0 28 33 0 0 0 0 0 0 0 40 0 31 0 0 0 0 0 40 0 31 17 42 0 0 38 0 0 0 0 0 17 18 0 0 0 0 0 0 0 45 38 17 25 0 0 12 24 14 40 15 8 0 0 0 0 17 0 0 0 0 38 0 0 0 0 0 0 0 0 0 0 0 45 0 0 0 41 24 0 14 0 0 0 0 0 0 0 21 0 38 12 3 0 0 0 0 0 0 0 0 0 0 34 39 0 34 14 0 0 0 0 0 0 30 21 15 27 34 18 0 0 0 15 0 0 0 0 0 0 0 0 11 0 32 6 36 43 0 0 0 0 0 0 21 35 6 0 13 0 24 16 0 0 0 0 0 0 0 0 0 12 37 0 0 14 13 0 0 0 0 0 0 0 43 1 12 1 20 0 0 20 19 22 0 0 0 0 0 0 44 26 0 0 0 1 0 0 0 8 24 0 0 0 0 0 8 0 38 44 1 0 0 0 0 0 0 0 0 0 0 14 0 0 42 30 0 0 0 0 14 0 0 0 0 0 34 0 43 1 30 0 0 0 0 0 0 0 0 0 31 27 0 15 32 0 0 0 0 0 32 0 0 39 0 0 31 0 0 42 0 0 42 0 0 0 0 0 0 0 0 21 0 0 14 3 0 0 0 0 1 21 35 45 0 0 0 0 20 11 0 0 0 0 0 0 0 0 0 0 0 28 44 0 36 21 0 0 0 0 0 0 0 8 0 0 0 0 21 23 0 24 0 0 0 0 0 0 0 0 0 31 21 29 34 0 0 0 0 0 0 0 36 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 29 43 0 0 39 0 0 0 0 0 0 0 37 37 0 0 0 0 0 0 0 0 0 0 0 0 0 41 0 0 0 33 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 22 24 0 0 0 0 17 0 15 0 0 0 0 14 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 28 0 0 24 3 0 0 0 32 0 0 0 1 0 0 0 0 0 0 0 0 0 0 21 0 0 0 0 23 1 22 15 1 25 0 0 0 0 19 43 0 32 0 25 0 0 0 0 0 27 27 0 0 4 0 0 0 25 0 9 0 0 5 0 0 0 0 0 0 19 3 13 37 41 0 0 0 0 0 0 5 0 0 16 0 0 0 5 0 0 10 33 12 0 0 0 0 0 0 0 0 11 11 20 20 0 0 0 0 10 7 28 0 0 0 0 0 0 0 45 0 0 6 0 0 0 0 0 0 0 8 0 43 3 30 0 0 8 30 4 0 32 37 0 0 0 0 22 21 40 14 0 0 0 0 0 0 0 0 0 0 25 17 0 0 0 0 0 0 0 0 12 0 0 0 0 0 0 20 44 0 0 0 0 0 0 0 11 0 0 44 38 30 0 0 0 0 0 0 0 0 0 0 0 0 0 0 32 0 0 0 0 0 36 41 0 0 11 0 0 0 33 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 31 0 0 0 0 0 0 0 0 1 36 0 0 0 41 37 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 22 0 0 0 0 0 0 0 12 43 4 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 19 9 16 16 0 0 0 0 0 0 37 12 0 0 0 0 0 9 0 0 0 29 0 0 
출력:
#1 100
#2 100
#3 100
#4 100
#5 100
#6 100
#7 100
#8 100
#9 100
#10 100
#11 100
#12 100
#13 100
#14 100
#15 100
#16 100
#17 100
#18 100
#19 100
#20 100
#21 100
#22 100
#23 100
#24 100
#25 100
"""

# ── User Code ──
from typing import List
from collections import deque
import heapq


class RESULT:
    def __init__(self, mHeights: List[List[int]]):
        self.heights = mHeights


dydx = [[-1, 0], [0, 1], [1, 0], [0, -1]]

g_N = -1
board = []
direction_board = []


def border_changer(cy, cx):
    global g_N
    if 0 <= cy < g_N and 0 <= cx < g_N:
        return cy, cx

    return (cy + g_N) % g_N, (cx + g_N) % g_N


def melt():
    visited = set()

    def melt_bfs(sy, sx):
        visited.add((sy, sx))
        q = deque()
        q.append((sy, sx))

        while q:
            cy, cx = q.popleft()
            for d in range(4):
                dy, dx = dydx[d]
                ny = cy + dy
                nx = cx + dx
                ny, nx = border_changer(ny, nx)
                if (ny, nx) in visited:
                    continue
                visited.add((ny, nx))
                if board[ny][nx] >= 1:
                    board[ny][nx] -= 1
                    continue
                q.append((ny, nx))

    for i in range(g_N):
        for j in range(g_N):
            if (i, j) not in visited and board[i][j] == 0:
                melt_bfs(i, j)


class Ice:
    def __init__(self):
        self.area = -1
        self.volume = -1
        self.direction = -1
        self.pos_set = set()
        self.y = -1
        self.x = -1


def spread_direction(sy, sx, direction):
    global direction_board
    # bfs

    visited = set()

    visited.add((sy, sx))
    direction_board[sy][sx] = direction
    q = deque()
    q.append((sy, sx))
    while q:
        cy, cx = q.popleft()
        for d in range(4):
            dy, dx = dydx[d]
            ny = cy + dy
            nx = cx + dx
            ny, nx = border_changer(ny, nx)
            if (ny, nx) in visited:
                continue
            if board[ny][nx] == 0:
                continue
            direction_board[ny][nx] = direction
            visited.add((ny, nx))
            q.append((ny, nx))


def move():
    global board, direction_board
    # 현재 보드에 있는 얼음 각각 id 화 시키기
    ice_cnt = 0
    visited = set()
    ices = dict()

    # bfs 각각 얼음 bfs 로 만들기
    def id_bfs(sy, sx):
        nonlocal ice_cnt
        visited.add((sy, sx))
        local_visited = set()
        local_visited.add((sy, sx))
        q = deque()
        q.append((sy, sx))
        area = 1
        volume = board[sy][sx]
        cur_direction = direction_board[sy][sx]

        min_y = sy
        min_x = sx

        while q:
            cy, cx = q.popleft()
            for d in range(4):
                dy, dx = dydx[d]
                ny = cy + dy
                nx = cx + dx
                ny, nx = border_changer(ny, nx)
                if (ny, nx) in visited:
                    continue
                if board[ny][nx] == 0:
                    continue
                visited.add((ny, nx))
                local_visited.add((ny, nx))
                q.append((ny, nx))
                area += 1
                volume += board[ny][nx]

                if ny < min_y:
                    min_y = ny
                    min_x = nx
                elif ny == min_y:
                    min_x = min(min_x, nx)

        ice = Ice()
        ice.volume = volume
        ice.area = area
        ice.direction = cur_direction
        ice.pos_set = local_visited
        ice.y = min_y
        ice.x = min_x

        ices[ice_cnt] = ice
        ice_cnt += 1

    for i in range(g_N):
        for j in range(g_N):
            if (i, j) not in visited and board[i][j] != 0:
                id_bfs(i, j)

    ice_set = [list(set() for _ in range(g_N)) for _ in range(g_N)]
    new_board = [[0] * g_N for _ in range(g_N)]

    # ices 안에 있는 빙하 이동
    for ice_id, ice in ices.items():
        cur_dir = ice.direction
        dy, dx = dydx[cur_dir]

        for cy, cx in ice.pos_set:
            ny = cy + dy
            nx = cx + dx
            ny, nx = border_changer(ny, nx)
            new_board[ny][nx] = max(new_board[ny][nx], board[cy][cx])
            ice_set[ny][nx].add(ice_id)

            # set bfs 로다가 새로 위치 정하기
    visited = set()

    # 빙하 교체
    board = new_board

    def loc_bfs(sy, sx):
        cand = set()
        visited.add((sy, sx))
        cand = cand.union(ice_set[sy][sx])

        q = deque()
        q.append((sy, sx))

        while q:
            cy, cx = q.popleft()
            for d in range(4):
                dy, dx = dydx[d]
                ny = cy + dy
                nx = cx + dx
                ny, nx = border_changer(ny, nx)
                if (ny, nx) in visited:
                    continue
                if len(ice_set[ny][nx]) == 0:
                    continue
                cand = cand.union(ice_set[ny][nx])
                q.append((ny, nx))
                visited.add((ny, nx))
        return cand

    direction_board = [[-1] * g_N for _ in range(g_N)]
    for i in range(g_N):
        for j in range(g_N):
            if not (i, j) in visited and len(ice_set[i][j]) >= 1:
                candidates = loc_bfs(i, j)
                hq = []
                for cand in candidates:
                    cur_ice = ices[cand]
                    cur_volume = cur_ice.volume
                    cur_area = cur_ice.area
                    cur_y = cur_ice.y
                    cur_x = cur_ice.x
                    cur_direction = cur_ice.direction
                    heapq.heappush(hq, [-cur_volume, cur_area, cur_y, cur_x, cur_direction])
                y = hq[0][2]
                x = hq[0][3]
                new_direction = hq[0][4]
                spread_direction(i, j, new_direction)


def init(N: int, M: int, mIceBlock: List[List[int]], mIceGroup: List[List[int]]) -> None:
    global g_N, board, direction_board
    g_N = N
    board = [[0] * g_N for _ in range(g_N)]
    direction_board = [[-1] * g_N for _ in range(g_N)]

    board = mIceBlock

    for m in range(M):
        x, y, direction = mIceGroup[m]
        # print(y, x, direction)
        spread_direction(y, x, direction)
    #
    # print("debug ice")
    # for i in board:
    #     print(i)
    # print("debug dir")
    # for i in direction_board:
    #     print(i)
    # melt()
    # print("debug after melt")
    # for i in board:
    #     print(i)
    #
    # move()
    # print("debug after move")
    # for i in board:
    #     print(i)
    # print("debug after move direction")
    # for i in direction_board:
    #     print(i)
    #
    # print("debug ice2")
    # for i in board:
    #     print(i)
    # print("debug dir2")
    # for i in direction_board:
    #     print(i)
    # melt()
    # print("debug after melt2")
    # for i in board:
    #     print(i)
    #
    # move()
    # print("debug after move2")
    # for i in board:
    #     print(i)
    # print("debug after move direction2")
    # for i in direction_board:
    #     print(i)

    pass


def oneYearLater() -> RESULT:
    melt()
    move()
    res = RESULT([[0 for _ in range(100)] for _ in range(100)])
    for i in range(g_N):
        for j in range(g_N):
            res.heights[i][j] = board[i][j]
    return res


# ── Main (수정 불가) ──
import sys
# (합쳐서 실행하므로 import 제거)

def run():
    n, m, k = map(int, input().split())
    mIceBlock = []
    for i in range(n):
        mIceBlock.append(list(map(int, input().split())))

    mIceGroup = []
    for i in range(m):
        mIceGroup.append(list(map(int, input().split())))

    init(n, m, mIceBlock, mIceGroup)

    okay = True

    for q in range(k):
        user_ans = oneYearLater()
        correctAns = list(map(int, input().split()))
        for y in range(n):
            for x in range(n):
                if user_ans.heights[y][x] != correctAns[y*n+x]:
                    okay = False


    return okay


#sys.stdin = open('sample_input.txt', 'r')

T, MARK = map(int, input().split())

for tc in range(1, T + 1):
    score = MARK if run() else 0
    print("#%d %d" % (tc, score), flush = True)
