"""
CT 4085  계단 오르기 2
https://www.codetree.ai/ko/trails/complete/curated-cards/intro-climbing-stairs-2/description

풀이일 : 2026-10-15   결과: 못품
한도   : time Python3 1초 · C++17 0.5초 / memory 128 MB / time_sec 1
난이도 : Easy  |  정답률 48.2%
제약   : - $2 \le N \le 1\,000$
제약   : - $1 \le C_i \le 1\,000$ $(1 \le i \le N)$

[문제]
남우는 $N$층 높이의 계단을 오르려고 합니다. 남우는 계단을 오를 때 한 번에 정확히 $1$계단 혹은 $2$계단 단위로만 올라갈 수 있습니다.

계단의 각 층에는 동전들이 떨어져 있습니다. 만약 남우가 해당 층을 밟고 지나가면, 아주 빠르게 해당 층에 있는 동전을 쓸어갈 수 있습니다.

남우는 빠르게 계단을 올라가고 싶기 때문에, $1$계단 오르는 것을 좋아하지 않습니다. 따라서 이 행동은 최대 $3$번만 하고자 합니다.

조건에 맞춰서 남우가 계단을 $N$층까지 올라가고자 할 때, 올라가면서 얻을 수 있는 동전의 최대 개수를 구하는 프로그램을 작성하세요.

[예제 1]
입력:
4
1 2 3 4

출력:
9


[예제 2]
입력:
6
3 7 11 2 9 6

출력:
33

"""

.
