"""
CT 4086  숫자 전쟁
https://www.codetree.ai/ko/trails/complete/curated-cards/challenge-number-war/description

풀이일 : 2026-10-15   결과: 못품
한도   : time Python3 1초 · C++17 0.5초 / memory 128 MB / time_sec 1
난이도 : Easy  |  정답률 58.3%
제약   : - $2 \le N \le 1\,000$
제약   : - $1 \le \texttt{카드 번호} \le 2\,000$

[문제]
"카드 대결: 숫자 전쟁"이라는 게임이 있습니다. 이 게임은 두 플레이어가 카드를 이용해 대결하는 게임입니다. 두 플레이어에게 똑같은 개수의 카드가 주어집니다. 각 카드에는 무작위의 양의 정수가 적혀 있습니다.

게임이 진행되는 동안 두 플레이어는 두 더미의 맨 위 카드를 비교하며 전략적으로 카드를 플레이합니다.

규칙은 다음과 같습니다:

- 매 턴 두 플레이어는 남우의 점수가 최대가 되도록 협력하여 둘 중 하나를 선택합니다:

$1.$ 카드 대결 : 두 플레이어는 서로의 카드를 비교합니다. 만약 자신의 카드가 상대방의 카드보다 작다면, 그 카드에 적혀있는 점수만큼 점수를 얻고 카드의 번호가 작은 사람의 카드를 버립니다. 만약 둘의 카드가 같다면, 두 명 모두 점수를 얻지 못하며 둘의 카드를 모두 버립니다.

$2.$ 카드 버리기 : 두 플레이어는 서로의 카드를 버립니다.

- 게임은 한쪽 더미의 카드가 모두 소진될 때까지 계속되며, 그때까지 얻은 점수의 합이 플레이어의 최종 점수가 됩니다.

남우는 두 번째 플레이어입니다. 플레이를 했을 때 나올 수 있는 점수 중 남우가 받을 수 있는 최고 점수를 출력하는 프로그램을 작성하세요.

예를 들어, 첫 번째 플레이어의 더미가 $3$, $2$, $5$이고, 두 번째 플레이어의 더미가 $2$, $4$, $1$일 때에는 다음과 같은 경우 남우가 최대 점수를 얻을 수 있습니다.

1. 첫 번째 대결: 상대방의 카드는 $3$, 남우의 카드는 $2$입니다. 여기서 $2$는 $3$보다 작으므로, $2$점을 얻고 남우의 $2$번 카드가 버려집니다.
   
2. 두 번째 대결: 이제 상대방의 카드는 $3$, 남우의 카드는 $4$입니다. 상대방은 $3$점을 얻고 $3$번 카드를 버립니다.

3. 세 번째 대결: 상대방의 카드는 $2$, 남우의 카드는 $4$입니다. 상대방은 $2$점을 얻고 $2$번 카드를 버립니다.

4. 네 번째 대결: 상대방의 카드는 $5$, 남우의 카드는 $4$입니다. 남우는 $4$점을 얻고 $4$번 카드를 버립니다.

5. 다섯 번째 대결: 상대방의 카드는 $5$, 남우의 카드는 $1$입니다. 남우는 $1$점을 얻고 $1$번 카드를 버립니다.

따라서 첫 번째 대결에서 $2$점, 네 번째 대결에서 $4$점, 다섯 번째 대결에서 $1$점을 얻어 총 $7$점을 획득합니다.

[예제 1]
입력:
3
3 2 5
2 4 1

출력:
7


[예제 2]
입력:
4
3 2 5 1
4 6 4 4

출력:
8

"""

.
