"""
CT 4089  도전! 369게임
https://www.codetree.ai/ko/trails/complete/curated-cards/challenge-369-game-challenge/description

풀이일 : 2026-10-17   결과: 못품
한도   : time Python3 1초 · C++17 0.5초 / memory 128 MB / time_sec 1
난이도 : Hard  |  정답률 42.2%
제약   : - $1 \le N \le 10^{100\,000}$

[문제]
남우는 친구들이랑 변형 $369$게임을 하고 있습니다. 변형 $369$게임 속에서는 사람들이 $1$부터 순서대로 정수를 불러 나가는데, 정수에 $3$, $6$, $9$가 포함되어 있거나 $3$의 배수라면 박수를 쳐야 합니다.

예를 들어, $1$부터 진행한다고 했을 때 $1$, $2$, 짝, $4$, $5$, 짝, $7$, $8$, 짝, $10$, $11$, 짝, 짝, $\cdots$, 순서로 진행됩니다.

이 $369$게임을 $N$까지 이어 나갔을 때 최종적으로 박수를 몇 번 치게 되는지 구하는 프로그램을 작성하세요.

[예제 1]
입력:
13

출력:
5


[예제 2]
입력:
11111

출력:
9253

"""

.
