"""
CT 4090  축구와 야구
https://www.codetree.ai/ko/trails/complete/curated-cards/test-soccer-and-baseball/description

풀이일 : 2026-10-17   결과: 못품
한도   : time Python3 1초 · C++17 0.5초 / memory 128 MB / time_sec 1
난이도 : Medium  |  정답률 53.4%
제약   : - $20 \le N \le 1\,000$
제약   : - $1 \le s,\ b \le 100\,000$

[문제]
코드트리 고등학교에서 축구 대회와 야구 대회 팀을 뽑기로 했습니다. 축구팀은 $11$명, 야구팀은 $9$명으로 구성됩니다. 이 때 두 팀의 능력의 합이 최대가 되도록 $N$명의 학생들을 축구팀, 야구팀으로 선발하고자 합니다.

$N$명의 각 학생들의 축구 능력, 야구 능력 정보가 주어졌을 때, 두 팀의 능력의 합이 최대가 되도록 선발했을 때의 능력의 합의 최대를 출력하세요.

[예제 1]
입력:
20
520 480
500 450
500 450
500 450
500 450
500 450
500 450
500 450
500 450
500 450
500 450
500 450
450 500
450 500
450 500
450 500
450 500
450 500
450 500
450 500

출력:
9980

"""

.
