# 작성한 코드를 채점하려면 이 파일을 실행하세요
import skeleton1

gridlist = [
    [
        [1, 1, 0],
        [1, 1, 0],
        [0, 0, 0]
    ],
    [
        [2, 2, 2],
        [2, 2, 0],
        [0, 0, 0]
    ],
    [
        [3, 3, 0, 5, 5, 5],
        [3, 3, 0, 5, 5, 5],
        [0, 0, 0, 5, 5, 5],
        [1, 1, 0, 0, 0, 0],
        [1, 1, 0, 0, 0, 0]
    ],
    [
        [7, 7, 7],
        [0, 0, 0],
        [4, 4, 4]
    ],
    [
        [9, 9, 9, 9, 0, 0],
        [9, 9, 9, 9, 1, 1],
        [9, 9, 9, 9, 0, 0],
        [9, 9, 9, 9, 0, 0],
        [0, 0, 1, 1, 8, 8],
        [0, 1, 0, 1, 8, 8]
    ]
]
anslist = [1, 0, 3, 0, 3]

score = 0
for i, g in enumerate(gridlist):
    if skeleton1.solution(g) == anslist[i]:
        score += 20

print("점수 : ", score)